Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
	FLEXSPI_SoftwareReset (base);
	status_t stat = base->WaitBusBusy ();
	if (stat != kStatus_Success)
		return LibmemStaus_Error;


	static uint8_t write_buffer[QSPIFLASH_PAGE_SIZE];
	LibmemDriver *FlashHandle = LibmemDriver::GetDriver ();
//	libmem_register_driver (FlashHandle, GetBaseAddress(base), FlashSize, geometry, nullptr, &DriverFunctions, &DriverFunctions_Extended);
	libmem_register_driver (FlashHandle, GetBaseAddress(base), FlashSize, geometry, nullptr, &DriverFunctions, nullptr);
	int err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, 0);
	FlashHandle->user_data = (uint32_t)base;

	uint8_t *AliasAddress = GetAliasBaseAddress (base);
	if (AliasAddress != nullptr && err == LIBMEM_STATUS_SUCCESS)
	{
		FlashHandle = LibmemDriver::GetDriver ();
		libmem_register_driver (FlashHandle, AliasAddress, FlashSize, geometry, nullptr, &DriverFunctions, nullptr);
		err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, 0);
		FlashHandle->user_data = (uint32_t)base;
		DebugPrint ("### Add Driver for Alias\r\n");
	}
	return static_cast<LibmemStatus_t>(err);
}


/*! ReadJEDEC
\brief Read the JEDEC Device informations
\param base The Flex-SPI-base to use
\param info The read Device informations from the flash memory
\return status_t Status of the Operation - kStatus_Success when successfully */
static status_t ReadJEDEC (FlexSPI_Helper *base, struct DeviceInfo *info)
{
	status_t status = base->ReadJEDEC (info);
	switch (info->ManufactureID)
	{
		case ManufactureID_AdestoTechnologies:
			switch (info->Type & 0x1FU)
			{
				case 0x06:
					info->Capacity = Capacity_16MBit;
					break;
				case 0x07:
					info->Capacity = Capacity_32MBit;
					break;
				case 0x08:
					info->Capacity = Capacity_64MBit;
					break;
				case 0x09:
					info->Capacity = Capacity_128MBit;
					break;
			}
			break;
		case ManufactureID_Macronix:
			info->Capacity = static_cast<Capacity>(info->Capacity & 0x1F);
			break;
		case ManufactureID_Atmel:
			switch (info->Type)
			{
				case  0x89:	// AT25SF128A
					info->Capacity = Capacity_128MBit;
					break;
				case  0xA8:	// ATXP064
					info->Capacity = Capacity_64MBit;
					break;
			}
			break;
		default:
			break;
	}

	return status;
}


/*! EraseChip:
Erase the whole-Flash-memory
\param base The FlexSPI-Interface where the Flash is located which should be erased
\return static status_t Status of the Operation - kStatus_Success when successfully */
[[maybe_unused]] static status_t EraseChip (FlexSPI_Helper *base)
{
	DebugPrint ("EraseChip\r\n");

	status_t stat = base->WriteEnable (0);
	if (stat != kStatus_Success)
		return stat;

	stat = base->SendCommand (0, LUT_EraseChip);
	if (stat != kStatus_Success)
		return LIBMEM_STATUS_ERROR;

	return base->WaitBusBusy ();
}

/*! EraseSector:
Erase a sector of the Flash-Memory
\param h Handle to the Flash-Driver
\param si Information about the sector which should be erased
\return static int LibmemStaus_Success when the erase operation was successfully, otherwise LibmemStaus_Error */
static int EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
{
	if (IsSectorEmpty (reinterpret_cast<uint32_t *>(si->start)))
	{
		DebugPrintf ("EraseSector at 0x%x, is allready erased\r\n", si->start);
		return LIBMEM_STATUS_SUCCESS;
	}

	FlexSPI_Helper *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
	uint32_t SectorAddr = libmem_CalculateOffset (h, si->start);
	if (SectorAddr == UINT32_MAX)
		return LibmemStaus_Error;

	DebugPrintf ("EraseSector at 0x%x, size: %d\r\n", SectorAddr, si->size);

	status_t status = base->WriteEnable (SectorAddr);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	status = base->SendCommand (SectorAddr, LUT_EraseSector);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	status = base->WaitBusBusy ();
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	return LibmemStaus_Success;
}

/*! ProgramPage:
Write Data to a Flash-Page
\param h Handle to the Flash-Driver
\param Destination Address to write the Data to. This Address is in the Address-Range of the Controller
\param Source Address of the Array with the data to write
\return static int LibmemStaus_Success when the write operation was successfully, otherwise LibmemStaus_Error */
static int ProgramPage (libmem_driver_handle_t *h, uint8_t *dest_addr, const uint8_t *src_addr)
{
	FlexSPI_Helper *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
	uint32_t DeviceAddress = libmem_CalculateOffset (h, dest_addr);
	if (DeviceAddress == UINT32_MAX)
		return LibmemStaus_Error;

	DebugPrintf ("ProgramPage at 0x%X\r\n", DeviceAddress);

	// Write enable
	status_t status = base->WriteEnable (DeviceAddress);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	// Prepare page program command
	flexspi_transfer_t flashXfer
	{
		DeviceAddress,				// deviceAddress	- Operation device address.
		FlexSPI_Helper::port,		// port				- Operation port
		kFLEXSPI_Write,				// cmdType			- Execution command type.
		LUT_ProgramPage,			// seqIndex			- Sequence ID for command.
		1,							// SeqNumber		- Sequence number for command.
		(uint32_t *)src_addr,		// data				- Data buffer.
		QSPIFLASH_PAGE_SIZE			// dataSize			- Data size in bytes.
	};
	status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	status = base->WaitBusBusy ();
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	// Do software reset or clear AHB buffer directly depending on the device capabilities
	#if defined(FSL_FEATURE_SOC_OTFAD_COUNT) && defined(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK) && defined(FLEXSPI_AHBCR_CLRAHBTXBUF_MASK)
		base->AHBCR |= FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK;
		base->AHBCR &= ~(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK);
	#else
		FLEXSPI_SoftwareReset (base);
	#endif
	return LibmemStaus_Success;
}

/*! libmem_ProgramPage:
The LIBMEM driver's write function.
\param h    A pointer to the handle of the LIBMEM driver.
\param dest A pointer to the memory address in memory range handled by driver to write data to.
\param src  pointer to the memory address to read data from.
\param size The number of bytes to write.
\return int The LIBMEM status result */
static int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	DebugPrintf ("libmem_ProgramPage at 0x%x - size: %d\r\n", dest, size);
	LibmemDriver *driver = static_cast<LibmemDriver *>(h);
	return libmem_driver_paged_write (h, dest, src, size, &driver->PageWriteControlBlock);
}

